# Категорія bin (звели до практичного набору, що відповідає API/сідам)
CATEGORY_CHOICES = [
    ('NONE', 'Без категорії'),
    ('DEV', 'DEV'),
    ('CONFIG', 'CONFIG'),
    ('LOG', 'LOG'),
]


# Мова для підсвітки синтаксису (синхронізовано з тестовими даними)
LANGUAGE_CHOICES = [
    ('none', 'Без мови'),
    ('bash', 'Bash'),
    ('c++', 'C++'),
    ('java', 'Java'),
    ('javascript', 'JavaScript'),
    ('python', 'Python'),
    ('ruby', 'Ruby'),
    ('swift', 'Swift'),
]

# Термін дії bin
EXPIRY_CHOICES = [
    ('never', 'Ніколи'),
    ('1m', '1 хвилина'),
    ('1h', '1 година'),
    ('12h', '12 годин'),
    ('1d', '1 день'),
    ('1w', '1 тиждень'),
    ('2w', '2 тижні'),
    ('30d', '30 днів'),
    ('6mo', '6 місяців'),
    ('1y', '1 рік'),
]

    # Доступність bin
ACCESS_CHOICES = [
    ('public', 'Публічний'),
    ('private', 'Приватний'),
]